// imports ================================================== //
import BlockInfo from "@/shared/components/BlockInfo";

// main ===================================================== //
const InfoAboutUserAgreement = () => {

    return (
        <BlockInfo>
            <h1>Пользовательское соглашение сайта WebChat</h1>
            <p>
                Добро пожаловать на Сайт WebChat, интернет-ресурс, который помогает вам
                поддерживать связь с вашими старыми и новыми друзьями. Сайт Webchat
                (webchat.ru) – это сетевой проект, объединяющий людей на основании мест
                учебы или работы.
            </p>
            <p>
                Администрация Сайта предоставляет вам доступ к использованию Сайта WebChat
                и его функциональности на условиях, являющихся предметом настоящих Правил
                пользования Сайтом WebChat. В этой связи вам необходимо внимательно
                ознакомиться с условиями настоящих Правил, которые рассматриваются
                Администрацией Сайта как публичная оферта в соответствии со ст. 437
                Гражданского кодекса Российской Федерации.
            </p>
            <h2>1. Термины, используемые в настоящих Правилах</h2>
            <p>
                1.1. Сайт «WebChat» (или Сайт) – социальная сеть, известная под именем
                «WebChat», размещённая на сайте в сети Интернет по адресу: webchat.ru
                (включая все уровни указанных доменов, как функционирующие на дату
                принятия Пользователем настоящих Правил, так и запускаемые и вводимые
                в эксплуатацию в течение всего срока его действия) и доступная
                Пользователю через сайт, мобильную версию сайта, приложения и иные
                ресурсы, представляющая собой результат интеллектуальной деятельности
                в форме программы для ЭВМ. Социальная сеть представлена в объективной
                форме совокупностью данных и команд, и порождаемых аудиовизуальных
                отображений (включая входящие в её состав графические изображения и
                пользовательский интерфейс), (далее – данные и команды),
                предназначенных для функционирования ЭВМ и мобильных устройств в
                целях получения определённого результата в виде организации
                функциональности социальной сети. Совокупность данных и команд состоит
                из активированных и неактивированных данных и команд.
            </p>
            <h2>2. Статус Правил пользования Сайтом ВКонтакте</h2>
            <p>
                2.1. Настоящие Правила пользования Сайтом ВКонтакте (ранее и далее –
                Правила) разработаны Администрацией Сайта и определяют условия
                использования и развития Сайта, его сервисов, а также права и
                обязанности его Пользователей и Администрации. Правила
                распространяются также на отношения, связанные с правами и интересами
                третьих лиц, не являющимися Пользователями Сайта, но чьи права и
                интересы могут быть затронуты в результате действий Пользователей
                Сайта.
            </p>
            <p>
                2.2. Настоящие Правила являются юридически обязательным соглашением
                между Пользователем и Администрацией Сайта, предметом которого
                является предоставление Администрацией Сайта Пользователю доступа
                к использованию Сайта и его функциональности. Помимо настоящих Правил,
                к соглашению между Пользователем и Администрацией Сайта относятся все
                специальные документы, регулирующие предоставление доступа к
                использованию отдельных функциональных возможностей Сайта (в том числе
                его неактивированных данных, команд и сервисов), размещённого в
                соответствующих разделах Сайта и/или в сервисах на Сайте.
            </p>
            <p>
                2.3. Пользователь обязан полностью ознакомиться с настоящими Правилами
                до момента регистрации на Сайте. Регистрация Пользователя на Сайте
                означает полное и безоговорочное принятие Пользователем настоящих Правил
                в соответствии со ст. 438 Гражданского кодекса Российской Федерации.
            </p>
            <p>
                2.4. Настоящие Правила могут быть изменены и/или дополненыАдминистрацией
                Сайта в одностороннем порядке с уведомлением в течение 3 (трёх) рабочих
                дней со дня внесения изменений и/или дополнений. Настоящие Правила
                являются открытым и общедоступным документом. Действующая редакция
                Правил располагается в сети Интернет по адресу: http://WebChat.com/terms.
                Администрация Сайта рекомендует Пользователям регулярно проверять
                условия настоящих Правил на предмет их изменения и/или дополнения.
                Продолжение использования Сайта Пользователем после внесения изменений
                и/или дополнений в настоящие Правила означает принятие и согласие
                Пользователя с такими изменениями и/или дополнениями.
            </p>
            <span>
                <i>Редакция от 20 января 2024 года</i>
            </span>
        </BlockInfo>
    );

};

// exports ================================================== //
export default InfoAboutUserAgreement;