"use strick";

export const DATA_TEXT = [
    {
        text: 'Лучшая награда для изобретателя – видеть, как созданная тобой технология приносит пользу людям.'
    },
    {
        title: "Что такое современный поиск?",
        text: `
        Традиционная задача любой поисковой системы — находить нужную информацию в интернете. В современном мире эта задача расширилась. Интернет уже нельзя отделить от реальности вокруг нас, и поисковые системы сейчас ищут по всему окружающему миру. И не только ищут, но и умеют подсказывать во всех жизненных ситуациях. Современный поиск понимает желания каждого пользователя и знает, что его окружает. Поэтому он может подсказать каждому человеку то, что подойдет именно ему. Что почитать, куда пойти поесть, какую музыку послушать, как быстрее попасть домой, где купить самые дешевые билеты.
        Поиск всегда был и остается главным сервисом Яндекса, однако сегодня мы понимаем его роль более широко — это универсальный помощник, навигатор по всему, что нас окружает. Поиск теперь — и подсказка в нужный момент, и помощь в выборе, и возможность совершить действие.
        `
    },
    {
        title: "Счастье пользователей",
        text: `
        Все сервисы Яндекса сделаны для того, чтобы улучшать и упрощать жизнь людей. Каждый из наших сервисов помогает делать что-то, что еще вчера казалось невозможным. Несколько лет назад мы не могли представить себе, что можно понять текст на незнакомом языке, не выясняя в словаре перевод каждого отдельного слова. Что можно мгновенно узнать адрес ближайшей работающей аптеки, находясь в любой точке города. Что такси не надо ждать или заказывать заранее. А сейчас это все совершенно обычные вещи.
Это и есть то, чем Яндекс занимается, — создает сервисы для людей. Сервисы, которые, с одной стороны, обладают глубоким знанием окружающего мира, с другой стороны, понимают интересы пользователей. Сервисы, которые меняют привычную среду и помогают людям достигать своих целей в жизни.
«Счастье пользователей» — очень важное для нас понятие. Среди прочего оно означает, что польза, которую приносит сервис, и то, насколько приятно с ним работать, для нас важнее, чем его монетизация. Как правило, если нам удается сделать хороший сервис, который нравится людям, его модель монетизации образуется сама собой. При этом она обязана учитывать интересы пользователя.
Основа нашей работы — технологический подход и статистическая проверка всех содержательных изменений на наших сервисах. Любое изменение должно быть обосновано — это помогает нам понять, действительно ли оно полезно, действительно ли хорошо для пользователей.
        `
    },
    {
        title: "Технологии мирового уровня",
        text: `
        Яндекс — технологическая компания. В основе наших сервисов лежат сложные, уникальные, трудно воспроизводимые технологии. Именно они позволяют нам делать то, что еще некоторое время назад люди приняли бы за волшебство.
Практически все сервисы Яндекса используют машинное обучение — для ранжирования в поиске, показа рекламы, машинного перевода. В 2009 году Яндекс разработал и внедрил собственный метод машинного обучения — Матрикснет.
Благодаря технологии распознавания речи пользователи Яндекс.Навигатора могут общаться с ним голосом, а не печатать адрес руками. Технология извлечения фактов отмечает для пользователей Почты некоторые письма — билеты, сообщения о встречах, информацию о скидках, чтобы в нужный момент их можно было сразу найти. Рекомендательная технология Диско помогает пользователям Музыки и Маркета выбрать композицию, подходящую под настроение, или нужный товар из множества аналогичных. Для поиска похожих изображений Яндекс использует свои разработки в области компьютерного зрения. В 2011 году мы запустили сервис машинного перевода — один из трех подобных во всем мире.
Чтобы сервисы и технологии могли функционировать, Яндекс поддерживает крупнейшую в России сеть центров обработки и хранения данных — десятки тысяч серверов. Вычислительные возможности и алгоритмы Яндекса используют и наши партнеры для проведения своих научных исследований — например, в области ядерных исследований и геологоразведки.
        `
    },
    {
        title: "Наука и образование",
        text: `
        Нам удалось собрать команду специалистов во многих областях науки — в математике, анализе данных, программировании, лингвистике и других дисциплинах. Кроме работы над сервисами и технологиями они активно занимаются образовательной деятельностью.
У Яндекса много своих учебных программ. С 2007 года работает Школа анализа данных — бесплатное учебное заведение для выпускников вузов и старшекурсников. ШАД готовит специалистов в области обработки и анализа данных и извлечения информации из интернета. Выпускники Школы работают и в Яндексе, и в других компаниях. Существуют и другие школы Яндекса: для менеджеров, разработчиков интерфейсов и т.д. Также Яндекс сотрудничает с учебными заведениями — в МФТИ работает наша базовая кафедра, а в ВШЭ в 2014 году при участии Яндекса открылся Факультет компьютерных наук. Мы даём базовые навыки программирования ученикам 8 и 9 классов в рамках двухгодичной программы образовательного проекта Яндекс.Лицей, спонсируем школьные олимпиады по информатике, математике, лингвистике.
Ежегодно Яндекс организовывает крупнейшую в России технологическую конференцию Yet another Conference, на которую собираются специалисты со всего мира, а также научную конференцию по машинному обучению. Кроме того, мы постоянно проводим семинары, лекции и мастер-классы для всех, кто уже связал свою карьеру с интернетом или только собирается это сделать.
        `
    }
];